---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsSizeLock
source: html/0c070346-2f29-b0b8-65c5-ac20608ae7bc.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsSizeLock Property

"Size Lock"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsSizeLock { get; }
```